blog/github-workflow-outside-browser.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-28 Thu 09:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GitHub Standard Fork And Pull Request From Inside Emacs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">GitHub Standard Fork And Pull Request From Inside Emacs</h1>
<div id="outline-container-org21d06c9" class="outline-2">
<h2 id="org21d06c9"><span class="section-number-2">1</span> Executive Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
Collaborating via GitHub (and similar platforms) requires
understanding and following a somewhat standardized fork, create, push
workflow. Most of the gory details of this workflow typically get
hidden by instructions of the form 
</p>
<pre class="example">
Sign in to GitHub in your browser and /push/ the button on the  top-left
</pre>

<p>
or something similar.
I live exclusively in Emacs and use  Chrome as the weapon of
last-resort, this article details  how to perform the afore-mentioned
GitHub collaboration workflow  from within Emacs. Caveat &#x2014; you may
still need to resort to Chrome or Firefox to set up GitHub tokens etc.
</p>
</div>
</div>

<div id="outline-container-org0040dfb" class="outline-2">
<h2 id="org0040dfb"><span class="section-number-2">2</span> The <i>Standard</i> GitHub Workflow</h2>
<div class="outline-text-2" id="text-2">
<p>
The GitHub collaboration workflow is documented (if somewhat sparsely)
on GitHub, and it's augmented by many excellent tutorials on the
Web. I will avoid repeating that information, other than to link to
them below and point out that reading those is essential to build a
clear mental picture of how things work. The remainder of this article
will focus on how to achieve the equivalent without having to <i>push</i>
buttons on the GitHub web site.
</p>

<ul class="org-ul">
<li><a href="https://gist.github.com/Chaser324/ce0505fbed06b947d962">Tutorial: GitHub Standard Fork &amp; Pull Request Workflow · GitHub</a></li>
<li><a href="https://help.github.com/en/github/collaborating-with-issues-and-pull-requests/creating-a-pull-request-from-a-fork">GitHub Help Pages</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgbf0cee8" class="outline-2">
<h2 id="orgbf0cee8"><span class="section-number-2">3</span> Collecting The Needed Tools</h2>
<div class="outline-text-2" id="text-3">
<p>
Here are the tools I needed to achieve the goal of achieving the above
workflow from within Emacs and without resorting to a Web browser.
</p>

<ol class="org-ol">
<li>Package <a href="https://github.com/magit/magit">Magit</a> from Melpa.</li>
<li>Package <a href="https://github.com/magit/forge">Magit/Forge</a> from Melpa.</li>
<li><a href="https://github.com/hub">Command-Line tool hub from GitHub</a></li>
<li><a href="https://github.com/cli">Newer Command-Line tool gh from GitHub</a>.</li>
</ol>


<p>
Command-line tools <i>gh</i> and <i>hub</i> are written in <i>go</i> and implement
the GitHub API.
At the time of writing, <i>hub</i> appears more complete, but <i>gh</i> is
catching up  fast.
</p>
</div>
</div>

<div id="outline-container-orga8acdcc" class="outline-2">
<h2 id="orga8acdcc"><span class="section-number-2">4</span> Implementing The GitHub Workflow</h2>
<div class="outline-text-2" id="text-4">
<p>
I'll use a concrete example to avoid introducing additional confusing
terminology.  In my own learning journey, I often got confused by
terminology such as <i>name</i>, <i>remote</i>, etc. each of which were being
used in a specialized sense.
</p>
</div>

<div id="outline-container-orgc182550" class="outline-3">
<h3 id="orgc182550"><span class="section-number-3">4.1</span> Task:</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Create a Pull-Request to project <i>speech-rule-engine</i> from  user
zorkow/ &#x2014; the project repository is 
<a href="https://github.com/zorkow/speech-rule-engine">Speech Rule Engine from user zorkow</a>.
</p>


<dl class="org-dl">
<dt>Fork</dt><dd>Fork the project you wish to contribute to. I found
multiple ways of doing this (eventually).
<ol class="org-ol">
<li>magit/forge inside emacs:</li>
</ol></dd>
</dl>
<pre class="example">
'cf RET RET
</pre>

<p>
This invokes command M-x forge-fork which prompts for two <i>name</i>
arguments. The meaning of those arguments are somewhat
non-obvious which is why I failed initially. To use it
successfully, set Forge Custom option  <i>forge-owned-accounts</i> to
your GitHub user-id &#x2014; in my case <i>tvraman</i>. Note that this
variable can hold a list of GitHub user-ids that you use.
</p>
<pre class="example">
(setq forge-owned-accounts '(("tvraman")))
</pre>

<p>
With the above in place, go to where you have the source
repository checked out, in my case:
</p>
<pre class="example">
cd ~/sources/zorkow/speech-rule-engine
</pre>

<p>
and open the <i>magit status</i> buffer by executing
</p>
<pre class="example">
M-x magit-status
</pre>

<p>
and execute Emacs command <i>forge-fork</i> &#x2014; by default
<span class="underline">magit/forge</span> binds this to <i>'cf</i>. The minibuffer shows the
user-id you set up in forge-owned-accounts/ earlier as the
default, press <i>RET</i> to accept the user-id value  for both the
<i>fork</i> and <i>remote</i> arguments.
</p>
<ul class="org-ul">
<li>The above flow works once it's all set-up &#x2014; note however that
if you are happier to just do this at the shell, you can use
either <i>hub</i> or <i>gh</i> &#x2014; read the documentation for those
commands. Either way, you now have a copy of the
<i>speech-rule-engine</i> project under your list of GitHub
repositories  &#x2014; in my case at <i><a href="https://github.com/tvraman/speech-rule-engine">https://github.com/tvraman/speech-rule-engine</a></i>.</li>
</ul>
<dl class="org-dl">
<dt>Clone</dt><dd>Next, <i>git clone</i>  the fork you just created. This is just a  regular clone operation, in my case I did:</dd>
</dl>
<pre class="example">
mkdir -p ~/sources/tvraman; cd ~/sources/tvraman; git clone https://github.com/tvraman/speech-rule-engine
</pre>

<dl class="org-dl">
<dt>Create Your Changes</dt><dd>Follow the steps from the earlier tutorials
to do your work, i.e., creating a feature-branch to hold your
changes,etc. Note that all this work is being done in your fork,
i.e., in this example, within <span class="underline">~/sources/tvraman/speech-rule-engine</span>.</dd>
<dt>Create Pull Request</dt><dd>When  ready, open the <i>magit-status</i> buffer
for your fork, and create the pull-request using magit/forge &#x2014;
in the  magit status buffer, type <i>'cp</i>.</dd>
<dt>Uploading The Pull Request</dt><dd>Now, you need to send the
pull-request to the author of the project you are contributing to
&#x2014; this is again one of those steps that all the docs talk about
pushing a button on GitHub.com. The easiest means I found to do
this was via command-line tool <span class="underline">hub</span>:</dd>
</dl>
<pre class="example">
cd ~/sources/tvraman/speech-rule-engine; hub pull-request 
</pre>

<p>
Assuming you have emacsclient configured as your EDITOR, this opens
a standard  commit-like message buffer that lets you complete the
action. Result: a new, shiny pull-request shows up in the target
project &#x2014; in this case in <span class="underline">zorkow/speech-rule-engine</span>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-05-28 Thu 00:00</p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2020-05-28 Thu 09:54</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
